AUTO_config_TK_pesok/src/DataProcessors/КорректностьЗаполненияСправочников/КорректностьЗаполненияСправочников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>КорректностьЗаполненияСправочников</name>
</mdclass:DataProcessor>

AUTO_config_TK_pesok/src/Catalogs/РолиСервисДеск/РолиСервисДеск.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>РолиСервисДеск</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Создание</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Выполнение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Закрытие</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипРоли</name>
    <type>
      <types>EnumRef.ТипыРолейСотрудников</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Сотрудники</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>DefinedType.Посетители</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Оборудование</name>
    <attributes>
      <name>Оборудование</name>
      <type>
        <types>CatalogRef.ОборудованиеПоставщиков</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

AUTO_config_TK_pesok/src/Catalogs/ТерриторииИсполнителей/ТерриторииИсполнителей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ТерриторииИсполнителей</name>
  <owners>Catalog.ФизическиеЛица</owners>
  <owners>Catalog.Посетители</owners>
  <tabularSections>
    <name>Точки</name>
    <attributes>
      <name>Точка</name>
      <type>
        <types>CatalogRef.ТорговыеПлощадки</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

AUTO_config_TK_pesok/src/Catalogs/ТорговыеПлощадки/ТорговыеПлощадки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ТорговыеПлощадки</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <attributes>
    <name>Global_ID</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПодразделениеКомпании</name>
    <comment>Подразделение компании в котором был выписан документ</comment>
    <type>
      <types>CatalogRef.ПодразделенияКомпании</types>
    </type>
  </attributes>
  <attributes>
    <name>GLN</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>13</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРегистрации</name>
    <comment>Используется при анализе первичного интереса</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РегистрироватьТК</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОткрытия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗакрытия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РазделятьТоварыПоОрганизациям</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РегистрацияОС_ТекущиеОстатки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТерриторияПоКОАТУУ</name>
    <comment>Название и код территории по КОАТУУ, на которой расположен торговая точка</comment>
    <type>
      <types>CatalogRef.КлассификаторКОАТУУ</types>
    </type>
  </attributes>
  <attributes>
    <name>Маршрут</name>
    <comment>Номер маршрута доставки (0 если не торгует)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АссортиментнаяМатрица</name>
    <type>
      <types>CatalogRef.АссортиментнаяМатрица</types>
    </type>
  </attributes>
  <attributes>
    <name>АлкоголемНеТоргуем</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РазрешительныеДокументы</name>
    <comment>Наличие разрешительных документов по ПБ</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорСистемаАПС</name>
    <comment>Договор на обслуживание системы АПС</comment>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидДляСписка</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>ДействуетС</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Потребители</name>
    <comment>Потребители коммунальных услуг</comment>
    <attributes>
      <name>Потребитель</name>
      <comment>Потребитель коммунальных услуг</comment>
      <type>
        <types>DefinedType.ПотребительКоммунальныхУслуг</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РекламныеПлоскости</name>
    <attributes>
      <name>Расположение</name>
      <type>
        <types>EnumRef.ПлоскостьПодРекламу</types>
      </type>
    </attributes>
    <attributes>
      <name>РекламныйНоситель</name>
      <type>
        <types>CatalogRef.РекламныеНосители</types>
      </type>
    </attributes>
    <attributes>
      <name>Сюжет</name>
      <type>
        <types>CatalogRef.СюжетыРекламныхНосителей</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Ширина</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОборудованиеПоставщиков</name>
    <attributes>
      <name>Оборудование</name>
      <type>
        <types>CatalogRef.ОборудованиеПоставщиков</types>
      </type>
    </attributes>
    <attributes>
      <name>СерийныйНомер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоНапитков</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Чай</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ИнвентарныйНомер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>IMEI_1</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>IMEI_2</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>15</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоДверей</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Договор</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаУстановки</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаВывоза</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Огнетушители</name>
    <attributes>
      <name>Огнетушитель</name>
      <type>
        <types>EnumRef.ТипыОгнетушителей</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаТО</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаСледующегоТО</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

AUTO_config_TK_pesok/src/DataProcessors/КорректностьЗаполненияСправочников/ManagerModule.bsl
Функция ПроверитьКорректностьЗаполненияСправочников(Ответственный) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	ТекДата = ТекущаяДата();
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.НачатьАвтогруппировкуСтрок();
	
	Макет = Обработки.КорректностьЗаполненияСправочников.ПолучитьМакет("Макет");
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОбластьЗаголовок.Параметры.НаДату = ТекДата;
	ОбластьЗаголовок.Параметры.Ответственный = Ответственный;
	ТабДок.Вывести(ОбластьЗаголовок,1);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РолиСервисДескСотрудники.Ссылка.Ответственный КАК Ответственный,
	|	РолиСервисДескСотрудники.Ссылка КАК Роль,
	|	РолиСервисДескСотрудники.Сотрудник КАК Сотрудник,
	|	ТерриторииИсполнителей.Ссылка КАК Территория
	|ИЗ
	|	Справочник.РолиСервисДеск.Сотрудники КАК РолиСервисДескСотрудники
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ТерриторииИсполнителей КАК ТерриторииИсполнителей
	|		ПО РолиСервисДескСотрудники.Сотрудник = ТерриторииИсполнителей.Владелец
	|ГДЕ
	|	РолиСервисДескСотрудники.Ссылка.Выполнение
	|	И НЕ РолиСервисДескСотрудники.Ссылка.ПометкаУдаления
	|	И РолиСервисДескСотрудники.Ссылка.Ответственный = &Ответственный
	|
	|УПОРЯДОЧИТЬ ПО
	|	РолиСервисДескСотрудники.Ссылка.Ответственный.Наименование,
	|	РолиСервисДескСотрудники.Ссылка.Наименование
	|ИТОГИ ПО
	|	Роль";
	
	Запрос.УстановитьПараметр("Ответственный", Ответственный);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ОбластьТочкиШапка = Макет.ПолучитьОбласть("ТочкиШапка");
	ОбластьРоль = Макет.ПолучитьОбласть("Роль");
	ТабДок.Вывести(ОбластьТочкиШапка,2);
	
	ВыборкаРоль = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаРоль.Следующий() Цикл
		тзТерриторий = ТаблицаТерриторий();
		
		ОбластьРоль.Параметры.Роль = ВыборкаРоль.Роль;
		ТабДок.Вывести(ОбластьРоль,3);
		
		Выборка = ВыборкаРоль.Выбрать();
		Пока Выборка.Следующий() Цикл
			ТерриторияСотрудника(Выборка, ТекДата, тзТерриторий);
		КонецЦикла;
		ПроверкаТерриторийНаЗаполненность(Макет, ТабДок, тзТерриторий, ВыборкаРоль, ТекДата);
		//ПроверкаТерриторийНаДублирование(Макет, ТабДок, тзТерриторий, ВыборкаРоль);
	КонецЦикла;
	
	ОбластьДублиШапка = Макет.ПолучитьОбласть("ДублиШапка");
	ТабДок.Вывести(ОбластьДублиШапка,2);
	ОбластьРоль = Макет.ПолучитьОбласть("Роль");
	
	ВыборкаРоль.Сбросить();
	Пока ВыборкаРоль.Следующий() Цикл
		тзТерриторий = ТаблицаТерриторий();
		
		ОбластьРоль.Параметры.Роль = ВыборкаРоль.Роль;
		ТабДок.Вывести(ОбластьРоль,3);
		
		Выборка = ВыборкаРоль.Выбрать();
		Пока Выборка.Следующий() Цикл
			ТерриторияСотрудника(Выборка, ТекДата, тзТерриторий);
		КонецЦикла;
		//ПроверкаТерриторийНаЗаполненность(Макет, ТабДок, тзТерриторий, ВыборкаРоль, ТекДата);
		ПроверкаТерриторийНаДублирование(Макет, ТабДок, тзТерриторий, ВыборкаРоль);
	КонецЦикла;
	
	ТабДок.ЗакончитьАвтогруппировкуСтрок();
	УстановитьПривилегированныйРежим(Ложь);
	Возврат ТабДок;
КонецФункции


Процедура ПроверкаТерриторийНаЗаполненность(Макет, ТабДок, тзТерриторий, ВыборкаРоль, ТекДата)	
	Оборудование = ВыборкаРоль.Роль.Оборудование;
	ОбластьТочкиДанных = Макет.ПолучитьОбласть("ТочкиДанные");
	
	Запрос = Новый Запрос;
	Если Оборудование.Количество() = 0 Тогда
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТЗ.Ответственный КАК Ответственный,
	|	ТЗ.Роль КАК Роль,
	|	ТЗ.Сотрудник КАК Сотрудник,
	|	ТЗ.Территория КАК Территория,
	|	ТЗ.Точка КАК Точка
	|ПОМЕСТИТЬ ТочкиРоли
	|ИЗ
	|	&ТЗ КАК ТЗ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТорговыеПлощадкиДополнительныеРеквизиты.Ссылка КАК Точка,
	|	ТорговыеПлощадкиДополнительныеРеквизиты.Значение КАК Куратор
	|ПОМЕСТИТЬ АктуальныеТочки
	|ИЗ
	|	Справочник.ТорговыеПлощадки.ДополнительныеРеквизиты КАК ТорговыеПлощадкиДополнительныеРеквизиты
	|ГДЕ
	|	ТорговыеПлощадкиДополнительныеРеквизиты.Свойство.Имя = ""КураторПлощадки""
	|	И НЕ(ТорговыеПлощадкиДополнительныеРеквизиты.Ссылка.ДатаЗакрытия > ТорговыеПлощадкиДополнительныеРеквизиты.Ссылка.ДатаОткрытия
	|				И &текДата > ТорговыеПлощадкиДополнительныеРеквизиты.Ссылка.ДатаЗакрытия)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	АктуальныеТочки.Точка.Код КАК Код,
	|	АктуальныеТочки.Точка КАК Точка,
	|	АктуальныеТочки.Точка.ПодразделениеКомпании КАК Подразделение,
	|	АктуальныеТочки.Куратор КАК Куратор,
	|	ТочкиРоли.Точка КАК ТочкаРоли,
	|	ТочкиРоли.Территория КАК Территория,
	|	ТочкиРоли.Сотрудник КАК Сотрудник,
	|	ТочкиРоли.Роль КАК Роль,
	|	ТочкиРоли.Ответственный КАК Ответственный
	|ИЗ
	|	АктуальныеТочки КАК АктуальныеТочки
	|		ПОЛНОЕ СОЕДИНЕНИЕ ТочкиРоли КАК ТочкиРоли
	|		ПО АктуальныеТочки.Точка = ТочкиРоли.Точка
	|ГДЕ
	|	(АктуальныеТочки.Точка ЕСТЬ NULL
	|			ИЛИ ТочкиРоли.Точка ЕСТЬ NULL)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Точка,
	|	ТочкаРоли
	|АВТОУПОРЯДОЧИВАНИЕ";
	
Иначе
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТЗ.Ответственный КАК Ответственный,
	|	ТЗ.Роль КАК Роль,
	|	ТЗ.Сотрудник КАК Сотрудник,
	|	ТЗ.Территория КАК Территория,
	|	ТЗ.Точка КАК Точка
	|ПОМЕСТИТЬ ТочкиРоли
	|ИЗ
	|	&ТЗ КАК ТЗ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТорговыеПлощадкиДополнительныеРеквизиты.Ссылка КАК Точка,
	|	ТорговыеПлощадкиДополнительныеРеквизиты.Значение КАК Куратор
	|ПОМЕСТИТЬ АктуальныеТочки
	|ИЗ
	|	Справочник.ТорговыеПлощадки.ДополнительныеРеквизиты КАК ТорговыеПлощадкиДополнительныеРеквизиты
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ТорговыеПлощадки.ОборудованиеПоставщиков КАК ТорговыеПлощадкиОборудованиеПоставщиков
	|		ПО ТорговыеПлощадкиДополнительныеРеквизиты.Ссылка = ТорговыеПлощадкиОборудованиеПоставщиков.Ссылка
	|			И (ТорговыеПлощадкиОборудованиеПоставщиков.Оборудование В ИЕРАРХИИ (&Оборудование))
	|ГДЕ
	|	ТорговыеПлощадкиДополнительныеРеквизиты.Свойство.Имя = ""КураторПлощадки""
	|	И НЕ(ТорговыеПлощадкиДополнительныеРеквизиты.Ссылка.ДатаЗакрытия > ТорговыеПлощадкиДополнительныеРеквизиты.Ссылка.ДатаОткрытия
	|				И &текДата > ТорговыеПлощадкиДополнительныеРеквизиты.Ссылка.ДатаЗакрытия)
	|	И ТорговыеПлощадкиОборудованиеПоставщиков.Оборудование ЕСТЬ НЕ NULL 
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	АктуальныеТочки.Точка.Код КАК Код,
	|	АктуальныеТочки.Точка КАК Точка,
	|	АктуальныеТочки.Точка.ПодразделениеКомпании КАК Подразделение,
	|	АктуальныеТочки.Куратор КАК Куратор,
	|	ТочкиРоли.Точка КАК ТочкаРоли,
	|	ТочкиРоли.Территория КАК Территория,
	|	ТочкиРоли.Сотрудник КАК Сотрудник,
	|	ТочкиРоли.Роль КАК Роль,
	|	ТочкиРоли.Ответственный КАК Ответственный
	|ИЗ
	|	АктуальныеТочки КАК АктуальныеТочки
	|		ПОЛНОЕ СОЕДИНЕНИЕ ТочкиРоли КАК ТочкиРоли
	|		ПО АктуальныеТочки.Точка = ТочкиРоли.Точка
	|ГДЕ
	|	ТочкиРоли.Точка ЕСТЬ NULL
	|
	|УПОРЯДОЧИТЬ ПО
	|	Точка,
	|	ТочкаРоли
	|АВТОУПОРЯДОЧИВАНИЕ";
	
		Запрос.УстановитьПараметр("Оборудование", Оборудование.Выгрузить().ВыгрузитьКолонку("Оборудование"));
	
КонецЕсли;
	
	Запрос.УстановитьПараметр("текДата", текДата);
	Запрос.УстановитьПараметр("ТЗ", тзТерриторий);
	
	РезультатЗапроса = Запрос.Выполнить();	//	РезультатЗапроса.Выгрузить()
	
	Если РезультатЗапроса.Пустой() Тогда
		ОбластьТочкиДанных.Параметры.Точка = "Все ОК";
		ТабДок.Вывести(ОбластьТочкиДанных,3);
	Иначе
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			ОбластьТочкиДанных.Параметры.Заполнить(Выборка);
			ТабДок.Вывести(ОбластьТочкиДанных,4);
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

Процедура ПроверкаТерриторийНаДублирование(Макет, ТабДок, тзТерриторий, ВыборкаРоль)
	
	ОбластьДублиДанных = Макет.ПолучитьОбласть("ДублиДанные");
	ОбластьРоль = Макет.ПолучитьОбласть("Роль");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТЗ.Ответственный КАК Ответственный,
	|	ТЗ.Роль КАК Роль,
	|	ТЗ.Сотрудник КАК Сотрудник,
	|	ТЗ.Территория КАК Территория,
	|	ВЫРАЗИТЬ(ТЗ.Точка КАК Справочник.ТорговыеПлощадки) КАК Точка
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	&ТЗ КАК ТЗ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ.Ответственный КАК Ответственный,
	|	ВТ.Роль КАК Роль,
	|	ВТ.Точка КАК Точка,
	|	КОЛИЧЕСТВО(ВТ.Территория) КАК Территория
	|ПОМЕСТИТЬ Точки
	|ИЗ
	|	ВТ КАК ВТ
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ.Ответственный,
	|	ВТ.Роль,
	|	ВТ.Точка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ.Ответственный КАК Ответственный,
	|	ВТ.Роль КАК Роль,
	|	Точки.Точка.Код КАК Код,
	|	ВТ.Точка КАК Точка,
	|	Точки.Территория КАК КолвоСотрудников,
	|	ВТ.Сотрудник КАК Сотрудник,
	|	ВТ.Территория КАК Территория
	|ИЗ
	|	ВТ КАК ВТ
	|		ЛЕВОЕ СОЕДИНЕНИЕ Точки КАК Точки
	|		ПО ВТ.Ответственный = Точки.Ответственный
	|			И ВТ.Роль = Точки.Роль
	|			И ВТ.Точка = Точки.Точка
	|ГДЕ
	|	Точки.Территория > 1
	|ИТОГИ
	|	МАКСИМУМ(Ответственный),
	|	МАКСИМУМ(Роль),
	|	МАКСИМУМ(КолвоСотрудников)
	|ПО
	|	Точка";
	
	Запрос.УстановитьПараметр("ТЗ", тзТерриторий);
	
	РезультатЗапроса = Запрос.Выполнить();	//	РезультатЗапроса.Выгрузить()
	
	Если РезультатЗапроса.Пустой() Тогда
		ОбластьДублиДанных.Параметры.Точка = "Все ОК";
		ТабДок.Вывести(ОбластьДублиДанных,3);
	Иначе
		ВыборкаТочка = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаТочка.Следующий() Цикл
			ОбластьДублиДанных.Параметры.Заполнить(ВыборкаТочка);
			ТабДок.Вывести(ОбластьДублиДанных,4);
			
			ВыборкаДетальныеЗаписи = ВыборкаТочка.Выбрать();
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				ОбластьДублиДанных.Параметры.Заполнить(ВыборкаДетальныеЗаписи);
				ТабДок.Вывести(ОбластьДублиДанных,5);
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;
	КонецПроцедуры




Функция ТаблицаТерриторий() Экспорт
	Типы = Новый Массив;
	Типы.Добавить(Тип("СправочникСсылка.ФизическиеЛица"));
	Типы.Добавить(Тип("СправочникСсылка.Посетители"));  
	ТаблицаТерриторий = Новый ТаблицаЗначений;
	ТаблицаТерриторий.Колонки.Добавить("Ответственный", Новый ОписаниеТипов("СправочникСсылка.ФизическиеЛица"));
	ТаблицаТерриторий.Колонки.Добавить("Роль", Новый ОписаниеТипов("СправочникСсылка.РолиСервисДеск"));
	ТаблицаТерриторий.Колонки.Добавить("Сотрудник", Новый ОписаниеТипов(Типы));
	ТаблицаТерриторий.Колонки.Добавить("Территория", Новый ОписаниеТипов("СправочникСсылка.ТерриторииИсполнителей"));
	ТаблицаТерриторий.Колонки.Добавить("Точка", Новый ОписаниеТипов("СправочникСсылка.ТорговыеПлощадки"));
	Возврат ТаблицаТерриторий;
КонецФункции




Процедура ТерриторияСотрудника(Выборка, ТекДата, тзТерриторий)
	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТорговыеПлощадкиДополнительныеРеквизиты.Ссылка КАК Точка
	|ИЗ
	|	Справочник.ТорговыеПлощадки.ДополнительныеРеквизиты КАК ТорговыеПлощадкиДополнительныеРеквизиты
	|ГДЕ
	|	ТорговыеПлощадкиДополнительныеРеквизиты.Ссылка В ИЕРАРХИИ
	|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|				ТерриторииИсполнителейТочки.Точка КАК Точка
	|			ИЗ
	|				Справочник.ТерриторииИсполнителей.Точки КАК ТерриторииИсполнителейТочки
	|			ГДЕ
	|				ТерриторииИсполнителейТочки.Ссылка = &Территория)
	|	И ТорговыеПлощадкиДополнительныеРеквизиты.Свойство.Имя = ""КураторПлощадки""
	|	И НЕ(ТорговыеПлощадкиДополнительныеРеквизиты.Ссылка.ДатаЗакрытия > ТорговыеПлощадкиДополнительныеРеквизиты.Ссылка.ДатаОткрытия
	|				И &текДата > ТорговыеПлощадкиДополнительныеРеквизиты.Ссылка.ДатаЗакрытия)";
	
	Запрос.УстановитьПараметр("текДата", текДата);
	Запрос.УстановитьПараметр("Территория", Выборка.Территория);
	
	РезультатЗапроса = Запрос.Выполнить();	//	РезультатЗапроса.Выгрузить()
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		нСтрока = тзТерриторий.Добавить();
		ЗаполнитьЗначенияСвойств(нСтрока, Выборка);
		ЗаполнитьЗначенияСвойств(нСтрока, ВыборкаДетальныеЗаписи);
	КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	
	
КонецПроцедуры
